validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/0/fluid/T
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}

dimensions [0 0 0 1 0 0 0];
internalField uniform 293.14999999999998;
boundaryField
{
rack_walls
{
 type zeroGradient;
}
test_inlet
{
 type fixedValue;
 value uniform 293.14999999999998;
}
test_outlet
{
 type inletOutlet;
 inletValue uniform 293.14999999999998;
 value uniform 293.14999999999998;
}
fluid_to_test_heater_0
{
 type compressible::turbulentTemperatureRadCoupledMixed;
 Tnbr T;
 kappaMethod fluidThermo;
 useImplicit false;
 qrNbr none;
 qr none;
 value uniform 293.14999999999998;
}
fluid_to_homogeneous_heater_1
{
 type compressible::turbulentTemperatureRadCoupledMixed;
 Tnbr T;
 kappaMethod fluidThermo;
 useImplicit false;
 qrNbr none;
 qr none;
 value uniform 293.14999999999998;
}
fluid_to_air_side_heater_2
{
 type compressible::turbulentTemperatureRadCoupledMixed;
 Tnbr T;
 kappaMethod fluidThermo;
 useImplicit false;
 qrNbr none;
 qr none;
 value uniform 293.14999999999998;
}
}
