validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/0/fluid/nut
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      nut;
}

dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
rack_walls
{
 type nutkWallFunction;
 value uniform 0;
}
test_inlet
{
 type calculated;
 value uniform 0;
}
test_outlet
{
 type calculated;
 value uniform 0;
}
fluid_to_test_heater_0
{
 type nutkWallFunction;
 value uniform 0;
}
fluid_to_homogeneous_heater_1
{
 type nutkWallFunction;
 value uniform 0;
}
fluid_to_air_side_heater_2
{
 type nutkWallFunction;
 value uniform 0;
}
}
