validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/0/heatSourceMask_0
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      heatSourceMask_0;
}

dimensions      [0 0 0 0 0 0 0];
internalField   nonuniform List<scalar>
20
(
0
0
0
0
1
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0
)
;
boundaryField
{
    ".*"
    {
        type  calculated;
        value uniform 0;
    }
}
