validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/0/test_heater_0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/test_heater_0";
    object      p;
}

dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
test_heater_0_to_fluid
{
 type calculated;
 value uniform 101325;
}
".*"
{
 type calculated;
 value uniform 101325;
}
}
