validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/air_side_heater_2/fvOptions
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/air_side_heater_2";
    object      fvOptions;
}

// No stamped heat sources.
