validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/air_side_heater_2/thermophysicalProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/air_side_heater_2";
    object      thermophysicalProperties;
}

thermoType
{
 type heSolidThermo;
 mixture pureMixture;
 transport constIso;
 thermo hConst;
 equationOfState rhoConst;
 specie specie;
 energy sensibleEnthalpy;
}
mixture
{
 specie { molWeight 50; }
 transport { kappa 10; }
 thermodynamics { Hf 0; Cp 800; }
 equationOfState { rho 1200; }
}
