validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/fluid/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      radiationProperties;
}

radiation off;
radiationModel none;
