validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/fluid/turbulenceProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      turbulenceProperties;
}

simulationType RAS;
RAS
{
 RASModel kOmegaSST;
 turbulence on;
 printCoeffs on;
}
