validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/homogeneous_heater_1/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/homogeneous_heater_1";
    object      radiationProperties;
}

radiation off;
radiationModel none;
