validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/polyMesh/boundary
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

3
(
rack_walls
{
    type       wall;
    nFaces     46;
    startFace  36;
}
test_inlet
{
    type       patch;
    nFaces     1;
    startFace  82;
}
test_outlet
{
    type       patch;
    nFaces     1;
    startFace  83;
}
)
