validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/constant/test_heater_0/radiationProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/test_heater_0";
    object      radiationProperties;
}

radiation off;
radiationModel none;
