validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/air_side_heater_2/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/air_side_heater_2";
    object      decomposeParDict;
}

#include "../decomposeParDict"
