validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     chtMultiRegionFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         12.5;
deltaT          0.0050000000000000001;
adjustTimeStep  yes;
maxCo           0.40000000000000002;
maxDeltaT       0.25;
timePrecision   17;
writeControl    adjustableRunTime;
writeInterval   2.5;

purgeWrite      3;
writeFormat     binary;
writePrecision  17;

functions
{
    fluid_temperature_range
    {
        type fieldMinMax;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        fields (T);
        location true;
    }
    fluid_temperature_average
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation volAverage;
        writeFields false;
        fields (T);
    }
    fluid_temperature_internal_maximum
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation max;
        writeFields false;
        fields (T);
    }
    fluid_y_plus
    {
        type yPlus;
        libs (fieldFunctionObjects);
        region fluid;
        // Write yPlus only with complete solver field output.
        // Independent diagnostic times are not restartable.
        writeControl writeTime;
    }
    test_heater_0_temperature_range
    {
        type fieldMinMax;
        libs (fieldFunctionObjects);
        region test_heater_0;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        fields (T);
        location true;
    }
    test_heater_0_temperature_average
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region test_heater_0;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation volAverage;
        writeFields false;
        fields (T);
    }
    test_heater_0_temperature_internal_maximum
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region test_heater_0;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation max;
        writeFields false;
        fields (T);
    }
    homogeneous_heater_1_temperature_range
    {
        type fieldMinMax;
        libs (fieldFunctionObjects);
        region homogeneous_heater_1;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        fields (T);
        location true;
    }
    homogeneous_heater_1_temperature_average
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region homogeneous_heater_1;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation volAverage;
        writeFields false;
        fields (T);
    }
    homogeneous_heater_1_temperature_internal_maximum
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region homogeneous_heater_1;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation max;
        writeFields false;
        fields (T);
    }
    air_side_heater_2_temperature_range
    {
        type fieldMinMax;
        libs (fieldFunctionObjects);
        region air_side_heater_2;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        fields (T);
        location true;
    }
    air_side_heater_2_temperature_average
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region air_side_heater_2;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation volAverage;
        writeFields false;
        fields (T);
    }
    air_side_heater_2_temperature_internal_maximum
    {
        type volFieldValue;
        libs (fieldFunctionObjects);
        region air_side_heater_2;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType all;
        operation max;
        writeFields false;
        fields (T);
    }
    test_inlet_mass_flow
    {
        type surfaceFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType patch;
        name test_inlet;
        operation sum;
        writeFields false;
        fields (phi);
    }
    test_inlet_mass_weighted_temperature
    {
        type surfaceFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType patch;
        name test_inlet;
        operation weightedAverage;
        weightField phi;
        writeFields false;
        fields (T);
    }
    test_outlet_mass_flow
    {
        type surfaceFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType patch;
        name test_outlet;
        operation sum;
        writeFields false;
        fields (phi);
    }
    test_outlet_mass_weighted_temperature
    {
        type surfaceFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType patch;
        name test_outlet;
        operation weightedAverage;
        weightField phi;
        writeFields false;
        fields (T);
    }
    ambient_net_mass_flow
    {
        type surfaceFieldValue;
        libs (fieldFunctionObjects);
        region fluid;
        writeControl adjustableRunTime;
        writeInterval 0.5;
        regionType patch;
        names (test_inlet test_outlet);
        operation sum;
        writeFields false;
        fields (phi);
    }
}
