validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/fluid/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      decomposeParDict;
}

#include "../decomposeParDict"
constraints
{
    coupledInterfaces
    {
        type singleProcessorFaceSets;
        sets ((chtCoupledInterfaces 0));
        enabled true;
    }
}
