validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/fluid/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}

solvers
{
 rho { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0.1; }
 rhoFinal { $rho; relTol 0; }
 p_rgh { solver GAMG; tolerance 1e-7; relTol 0.01; smoother GaussSeidel; }
 p_rghFinal { $p_rgh; relTol 0; }
 "(U|h|k|omega)" { solver PBiCGStab; preconditioner DILU; tolerance 1e-7; relTol 0.1; }
 "(U|h|k|omega)Final" { $U; relTol 0; }
}
PIMPLE
{
 momentumPredictor yes;
 nCorrectors 2;
 nNonOrthogonalCorrectors 0;
 pRefCell 0;
 pRefValue 101325;
 frozenFlow false;
 semiFrozenFlow false;
 thermalOnlyFlow false;
}
relaxationFactors
{
 equations { "h.*" 1; "U.*" 0.7; "(k|omega).*" 0.7; }
}
