validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/fvSolution
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

PIMPLE
{
    nOuterCorrectors 3;
    pRefCell 0;
    pRefValue 101325;
}
