validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/homogeneous_heater_1/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/homogeneous_heater_1";
    object      decomposeParDict;
}

#include "../decomposeParDict"
