validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/test_heater_0/decomposeParDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/test_heater_0";
    object      decomposeParDict;
}

#include "../decomposeParDict"
