validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/topoSetDict_fluid_interfaces
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict_fluid_interfaces;
}

actions
(
    {
        name chtCoupledInterfaces;
        type faceSet;
        action new;
        source patchToFace;
        patch fluid_to_test_heater_0;
    }
    {
        name chtCoupledInterfaces;
        type faceSet;
        action add;
        source patchToFace;
        patch fluid_to_homogeneous_heater_1;
    }
    {
        name chtCoupledInterfaces;
        type faceSet;
        action add;
        source patchToFace;
        patch fluid_to_air_side_heater_2;
    }
);
