validation/revised_native_regression_2026-08-26/.tmp_runner_journal_case/system/topoSetDict_porous_perforated_tray_0
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict_porous_perforated_tray_0;
}

actions
(
{ name porous_perforated_tray_0; type cellSet; action new;
  source fieldToCell; field porous_perforated_tray_0_mask; min 0.5; max 1.5; }
{ name porous_perforated_tray_0; type cellZoneSet; action new;
  source setToCellZone; set porous_perforated_tray_0; }
);
